tutorials/basic/potentialFoam/cylinderSkFem/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "inletVelocity"

internalField   uniform (0 0 0);

boundaryField
{
    "(down|up)"
    {
        type            symmetryPlane;
    }

    right
    {
        type            zeroGradient;
    }

    left
    {
        type            fixedValue;
        value           $inletVelocity;
    }

    cylinder
    {
        type            symmetry;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
